test/zoo/protected/ddl/protected_0_ddl.dbml
Table "Agence" {
  "id. agence" VARCHAR(42) [pk, not null]
  "nom agence" VARCHAR(42)
}

Table "Direction régionale" {
  "id. dir." VARCHAR(42) [pk, not null]
  "nom dir." VARCHAR(42)
}

Table "Superviser" {
  "id. agence" VARCHAR(42) [pk, not null]
  "id. dir."   VARCHAR(42) [not null]
}

Ref:"Superviser"."id. agence" > "Agence"."id. agence"
Ref:"Superviser"."id. dir." > "Direction régionale"."id. dir."
